window.onload = function () {
  var vm = new Vue({
    el: '#app',
    data: {
      isZZ: true, // 是否显示遮罩
      trailData: {
        1: [
          { 编号: 1, 名称: 'car 1', 经度: '-10', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 2, 名称: 'car 2', 经度: '-8', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 3, 名称: 'car 3', 经度: '-6', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 4, 名称: 'car 12', 经度: '-4', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 5, 名称: 'car 5', 经度: '-2', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 6, 名称: 'car 6', 经度: '0', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 7, 名称: 'car 7', 经度: '2', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 8, 名称: 'car 8', 经度: '4', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 9, 名称: 'car 9', 经度: '6', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 10, 名称: 'car 10', 经度: '8', 纬度: '-10', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 11, 名称: 'car 11', 经度: '-10', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 12, 名称: 'car 12', 经度: '-8', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 13, 名称: 'car 13', 经度: '-6', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 14, 名称: 'car 14', 经度: '-4', 纬度: '-8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 15, 名称: 'car 15', 经度: '-2', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 16, 名称: 'car 16', 经度: '0', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 17, 名称: 'car 17', 经度: '2', 纬度: '-8', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 18, 名称: 'car 18', 经度: '4', 纬度: '-8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 19, 名称: 'car 19', 经度: '6', 纬度: '-8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 20, 名称: 'car 20', 经度: '8', 纬度: '-8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 21, 名称: 'car 21', 经度: '-10', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 22, 名称: 'car 22', 经度: '-8', 纬度: '-6', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 23, 名称: 'car 23', 经度: '-6', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 24, 名称: 'car 24', 经度: '-4', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 25, 名称: 'car 25', 经度: '-2', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 26, 名称: 'car 26', 经度: '0', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 27, 名称: 'car 27', 经度: '2', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 28, 名称: 'car 28', 经度: '4', 纬度: '-6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 29, 名称: 'car 29', 经度: '6', 纬度: '-6', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 30, 名称: 'car 30', 经度: '8', 纬度: '-6', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 31, 名称: 'car 31', 经度: '-10', 纬度: '-4', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 32, 名称: 'car 32', 经度: '-8', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 33, 名称: 'car 33', 经度: '-6', 纬度: '-4', 高度: '0.15', 旋转: '180', 数值: 100 },
          { 编号: 34, 名称: 'car 34', 经度: '-4', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 35, 名称: 'car 35', 经度: '-2', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 36, 名称: 'car 36', 经度: '0', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 37, 名称: 'car 37', 经度: '2', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 38, 名称: 'car 38', 经度: '4', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 39, 名称: 'car 39', 经度: '6', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 40, 名称: 'car 40', 经度: '8', 纬度: '-4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 41, 名称: 'car 41', 经度: '-10', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 42, 名称: 'car 42', 经度: '-8', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 43, 名称: 'car 43', 经度: '-6', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 44, 名称: 'car 44', 经度: '-4', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 45, 名称: 'car 45', 经度: '-2', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 46, 名称: 'car 46', 经度: '0', 旋转: '180', 纬度: '-2', 高度: '0.15', 数值: 100 },
          { 编号: 47, 名称: 'car 47', 经度: '2', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 48, 名称: 'car 48', 经度: '4', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 49, 名称: 'car 49', 经度: '6', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 50, 名称: 'car 50', 经度: '8', 纬度: '-2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 51, 名称: 'car 51', 经度: '-10', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 52, 名称: 'car 52', 经度: '-8', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 53, 名称: 'car 53', 经度: '-6', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 54, 名称: 'car 54', 经度: '-4', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 55, 名称: 'car 55', 经度: '-2', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 56, 名称: 'car 56', 经度: '0', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 57, 名称: 'car 57', 经度: '2', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 58, 名称: 'car 58', 经度: '4', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 59, 名称: 'car 59', 经度: '6', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 60, 名称: 'car 60', 经度: '8', 纬度: '0', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 61, 名称: 'car 61', 经度: '-10', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 62, 名称: 'car 62', 经度: '-8', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 63, 名称: 'car 63', 经度: '-6', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 64, 名称: 'car 64', 经度: '-4', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 65, 名称: 'car 65', 经度: '-2', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 66, 名称: 'car 66', 经度: '0', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 67, 名称: 'car 67', 经度: '2', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 68, 名称: 'car 68', 经度: '4', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 69, 名称: 'car 69', 经度: '6', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 70, 名称: 'car 70', 经度: '8', 纬度: '2', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 71, 名称: 'car 71', 经度: '-10', 纬度: '4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 72, 名称: 'car 72', 经度: '-8', 旋转: '180', 纬度: '4', 高度: '0.15', 数值: 100 },
          { 编号: 73, 名称: 'car 73', 经度: '-6', 旋转: '180', 纬度: '4', 高度: '0.15', 数值: 100 },
          { 编号: 74, 名称: 'car 74', 经度: '-4', 旋转: '180', 纬度: '4', 高度: '0.15', 数值: 100 },
          { 编号: 75, 名称: 'car 75', 经度: '-2', 旋转: '180', 纬度: '4', 高度: '0.15', 数值: 100 },
          { 编号: 76, 名称: 'car 76', 经度: '0', 旋转: '180', 纬度: '4', 高度: '0.15', 数值: 100 },
          { 编号: 77, 名称: 'car 77', 经度: '2', 纬度: '4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 78, 名称: 'car 78', 经度: '4', 纬度: '4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 79, 名称: 'car 79', 经度: '6', 纬度: '4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 80, 名称: 'car 80', 经度: '8', 纬度: '4', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 81, 名称: 'car 81', 经度: '-10', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 82, 名称: 'car 82', 经度: '-8', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 83, 名称: 'car 83', 经度: '-6', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 84, 名称: 'car 84', 经度: '-4', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 85, 名称: 'car 85', 经度: '-2', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 86, 名称: 'car 86', 经度: '0', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 87, 名称: 'car 87', 经度: '2', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 88, 名称: 'car 88', 经度: '4', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 89, 名称: 'car 89', 经度: '6', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 90, 名称: 'car 90', 经度: '8', 纬度: '6', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 91, 名称: 'car 91', 经度: '-10', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 92, 名称: 'car 92', 经度: '-8', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 93, 名称: 'car 93', 经度: '-6', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 94, 名称: 'car 94', 经度: '-4', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 95, 名称: 'car 95', 经度: '-2', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 96, 名称: 'car 96', 经度: '0', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 97, 名称: 'car 97', 经度: '2', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 98, 名称: 'car 98', 经度: '4', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 99, 名称: 'car 99', 经度: '6', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
          { 编号: 100, 名称: 'car 100', 经度: '8', 纬度: '8', 旋转: '180', 高度: '0.15', 数值: 100 },
        ],
        2: [
          { 编号: 1, 名称: 'car 1', 经度: '-8', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 2, 名称: 'car 2', 经度: '-6', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 3, 名称: 'car 3', 经度: '-4', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 4, 名称: 'car 4', 经度: '-2', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 5, 名称: 'car 5', 经度: '0', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 6, 名称: 'car 6', 经度: '2', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 7, 名称: 'car 7', 经度: '4', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 8, 名称: 'car 8', 经度: '6', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 9, 名称: 'car 9', 经度: '8', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 10, 名称: 'car 10', 经度: '10', 纬度: '-10', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 11, 名称: 'car 11', 经度: '-8', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 12, 名称: 'car 12', 经度: '-6', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 13, 名称: 'car 13', 经度: '-4', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 14, 名称: 'car 14', 经度: '-2', 纬度: '-8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 15, 名称: 'car 15', 经度: '0', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 16, 名称: 'car 16', 经度: '2', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 17, 名称: 'car 17', 经度: '4', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 18, 名称: 'car 18', 经度: '6', 纬度: '-8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 19, 名称: 'car 19', 经度: '8', 纬度: '-8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 20, 名称: 'car 20', 经度: '10', 纬度: '-8', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 21, 名称: 'car 21', 经度: '-8', 纬度: '-6', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 22, 名称: 'car 22', 经度: '-6', 纬度: '-6', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 23, 名称: 'car 23', 经度: '-4', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 24, 名称: 'car 24', 经度: '-2', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 25, 名称: 'car 25', 经度: '0', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 26, 名称: 'car 26', 经度: '2', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 27, 名称: 'car 27', 经度: '4', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 28, 名称: 'car 28', 经度: '6', 纬度: '-6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 29, 名称: 'car 29', 经度: '8', 纬度: '-6', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 30, 名称: 'car 30', 经度: '10', 纬度: '-6', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 31, 名称: 'car 31', 经度: '-8', 纬度: '-4', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 32, 名称: 'car 32', 经度: '-6', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 33, 名称: 'car 33', 经度: '-4', 纬度: '-4', 高度: '0.15', 旋转: '90', 数值: 80 },
          { 编号: 34, 名称: 'car 34', 经度: '-2', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 35, 名称: 'car 35', 经度: '0', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 36, 名称: 'car 36', 经度: '2', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 37, 名称: 'car 37', 经度: '4', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 38, 名称: 'car 38', 经度: '6', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 39, 名称: 'car 39', 经度: '8', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 40, 名称: 'car 40', 经度: '10', 纬度: '-4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 41, 名称: 'car 41', 经度: '-8', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 42, 名称: 'car 42', 经度: '-6', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 43, 名称: 'car 43', 经度: '-4', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 44, 名称: 'car 44', 经度: '-2', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 45, 名称: 'car 45', 经度: '0', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 46, 名称: 'car 46', 经度: '2', 旋转: '90', 纬度: '-2', 高度: '0.15', 数值: 80 },
          { 编号: 47, 名称: 'car 47', 经度: '4', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 48, 名称: 'car 48', 经度: '6', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 49, 名称: 'car 49', 经度: '8', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 50, 名称: 'car 50', 经度: '10', 纬度: '-2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 51, 名称: 'car 51', 经度: '-8', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 52, 名称: 'car 52', 经度: '-6', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 53, 名称: 'car 53', 经度: '-4', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 54, 名称: 'car 54', 经度: '-2', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 55, 名称: 'car 55', 经度: '0', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 56, 名称: 'car 56', 经度: '2', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 57, 名称: 'car 57', 经度: '4', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 58, 名称: 'car 58', 经度: '6', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 59, 名称: 'car 59', 经度: '8', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 60, 名称: 'car 60', 经度: '10', 纬度: '0', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 61, 名称: 'car 61', 经度: '-8', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 62, 名称: 'car 62', 经度: '-6', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 63, 名称: 'car 63', 经度: '-4', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 64, 名称: 'car 64', 经度: '-2', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 65, 名称: 'car 65', 经度: '0', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 66, 名称: 'car 66', 经度: '2', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 67, 名称: 'car 67', 经度: '4', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 68, 名称: 'car 68', 经度: '6', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 69, 名称: 'car 69', 经度: '8', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 70, 名称: 'car 70', 经度: '10', 纬度: '2', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 71, 名称: 'car 71', 经度: '-8', 纬度: '4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 72, 名称: 'car 72', 经度: '-6', 旋转: '90', 纬度: '4', 高度: '0.15', 数值: 80 },
          { 编号: 73, 名称: 'car 73', 经度: '-4', 旋转: '90', 纬度: '4', 高度: '0.15', 数值: 80 },
          { 编号: 74, 名称: 'car 74', 经度: '-2', 旋转: '90', 纬度: '4', 高度: '0.15', 数值: 80 },
          { 编号: 75, 名称: 'car 75', 经度: '0', 旋转: '90', 纬度: '4', 高度: '0.15', 数值: 80 },
          { 编号: 76, 名称: 'car 76', 经度: '2', 旋转: '90', 纬度: '4', 高度: '0.15', 数值: 80 },
          { 编号: 77, 名称: 'car 77', 经度: '4', 纬度: '4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 78, 名称: 'car 78', 经度: '6', 纬度: '4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 79, 名称: 'car 79', 经度: '8', 纬度: '4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 80, 名称: 'car 80', 经度: '10', 纬度: '4', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 81, 名称: 'car 81', 经度: '-8', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 82, 名称: 'car 82', 经度: '-6', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 83, 名称: 'car 83', 经度: '-4', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 84, 名称: 'car 84', 经度: '-2', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 85, 名称: 'car 85', 经度: '0', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 86, 名称: 'car 86', 经度: '2', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 87, 名称: 'car 87', 经度: '4', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 88, 名称: 'car 88', 经度: '6', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 89, 名称: 'car 89', 经度: '8', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 90, 名称: 'car 90', 经度: '10', 纬度: '6', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 91, 名称: 'car 91', 经度: '-8', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 92, 名称: 'car 92', 经度: '-6', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 93, 名称: 'car 93', 经度: '-4', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 94, 名称: 'car 94', 经度: '-2', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 95, 名称: 'car 95', 经度: '0', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 96, 名称: 'car 96', 经度: '2', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 97, 名称: 'car 97', 经度: '4', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 98, 名称: 'car 98', 经度: '6', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 99, 名称: 'car 99', 经度: '8', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
          { 编号: 100, 名称: 'car 100', 经度: '10', 纬度: '8', 旋转: '90', 高度: '0.15', 数值: 80 },
        ],
        3: [
          { 编号: 1, 名称: 'car 1', 经度: '-8', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 2, 名称: 'car 2', 经度: '-6', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 3, 名称: 'car 3', 经度: '-4', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 4, 名称: 'car 4', 经度: '-2', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 5, 名称: 'car 5', 经度: '0', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 6, 名称: 'car 6', 经度: '2', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 7, 名称: 'car 7', 经度: '4', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 8, 名称: 'car 8', 经度: '6', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 9, 名称: 'car 9', 经度: '8', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 10, 名称: 'car 10', 经度: '10', 纬度: '-8', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 11, 名称: 'car 11', 经度: '-8', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 12, 名称: 'car 12', 经度: '-6', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 13, 名称: 'car 13', 经度: '-4', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 14, 名称: 'car 14', 经度: '-2', 纬度: '-6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 15, 名称: 'car 15', 经度: '0', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 16, 名称: 'car 16', 经度: '2', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 17, 名称: 'car 17', 经度: '4', 纬度: '-6', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 18, 名称: 'car 18', 经度: '6', 纬度: '-6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 19, 名称: 'car 19', 经度: '8', 纬度: '-6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 20, 名称: 'car 20', 经度: '10', 纬度: '-6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 21, 名称: 'car 21', 经度: '-8', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 22, 名称: 'car 22', 经度: '-6', 纬度: '-4', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 23, 名称: 'car 23', 经度: '-4', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 24, 名称: 'car 24', 经度: '-2', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 25, 名称: 'car 25', 经度: '0', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 26, 名称: 'car 26', 经度: '2', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 27, 名称: 'car 27', 经度: '4', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 28, 名称: 'car 28', 经度: '6', 纬度: '-4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 29, 名称: 'car 29', 经度: '8', 纬度: '-4', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 30, 名称: 'car 29', 经度: '10', 纬度: '-4', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 31, 名称: 'car 31', 经度: '-8', 纬度: '-2', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 32, 名称: 'car 32', 经度: '-6', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 33, 名称: 'car 33', 经度: '-4', 纬度: '-2', 高度: '0.15', 旋转: '0', 数值: 60 },
          { 编号: 34, 名称: 'car 34', 经度: '-2', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 35, 名称: 'car 35', 经度: '0', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 36, 名称: 'car 36', 经度: '2', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 37, 名称: 'car 37', 经度: '4', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 38, 名称: 'car 38', 经度: '6', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 39, 名称: 'car 39', 经度: '8', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 40, 名称: 'car 40', 经度: '10', 纬度: '-2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 41, 名称: 'car 41', 经度: '-8', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 42, 名称: 'car 42', 经度: '-6', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 43, 名称: 'car 43', 经度: '-4', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 44, 名称: 'car 44', 经度: '-2', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 45, 名称: 'car 45', 经度: '0', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 46, 名称: 'car 46', 经度: '2', 旋转: '0', 纬度: '0', 高度: '0.15', 数值: 60 },
          { 编号: 47, 名称: 'car 47', 经度: '4', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 48, 名称: 'car 48', 经度: '6', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 49, 名称: 'car 49', 经度: '8', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 50, 名称: 'car 49', 经度: '10', 纬度: '0', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 51, 名称: 'car 51', 经度: '-8', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 52, 名称: 'car 52', 经度: '-6', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 53, 名称: 'car 53', 经度: '-4', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 54, 名称: 'car 54', 经度: '-2', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 55, 名称: 'car 55', 经度: '0', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 56, 名称: 'car 56', 经度: '2', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 57, 名称: 'car 57', 经度: '4', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 58, 名称: 'car 58', 经度: '6', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 59, 名称: 'car 59', 经度: '8', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 60, 名称: 'car 60', 经度: '10', 纬度: '2', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 61, 名称: 'car 61', 经度: '-8', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 62, 名称: 'car 62', 经度: '-6', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 63, 名称: 'car 63', 经度: '-4', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 64, 名称: 'car 64', 经度: '-2', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 65, 名称: 'car 65', 经度: '0', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 66, 名称: 'car 66', 经度: '2', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 67, 名称: 'car 67', 经度: '4', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 68, 名称: 'car 68', 经度: '6', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 69, 名称: 'car 69', 经度: '8', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 70, 名称: 'car 70', 经度: '10', 纬度: '4', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 71, 名称: 'car 71', 经度: '-8', 纬度: '6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 72, 名称: 'car 72', 经度: '-6', 旋转: '0', 纬度: '6', 高度: '0.15', 数值: 60 },
          { 编号: 73, 名称: 'car 73', 经度: '-4', 旋转: '0', 纬度: '6', 高度: '0.15', 数值: 60 },
          { 编号: 74, 名称: 'car 74', 经度: '-2', 旋转: '0', 纬度: '6', 高度: '0.15', 数值: 60 },
          { 编号: 75, 名称: 'car 75', 经度: '0', 旋转: '0', 纬度: '6', 高度: '0.15', 数值: 60 },
          { 编号: 76, 名称: 'car 76', 经度: '2', 旋转: '0', 纬度: '6', 高度: '0.15', 数值: 60 },
          { 编号: 77, 名称: 'car 77', 经度: '4', 纬度: '6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 78, 名称: 'car 78', 经度: '6', 纬度: '6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 79, 名称: 'car 79', 经度: '8', 纬度: '6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 80, 名称: 'car 80', 经度: '10', 纬度: '6', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 81, 名称: 'car 81', 经度: '-8', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 82, 名称: 'car 82', 经度: '-6', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 83, 名称: 'car 83', 经度: '-4', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 84, 名称: 'car 84', 经度: '-2', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 85, 名称: 'car 85', 经度: '0', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 86, 名称: 'car 86', 经度: '2', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 87, 名称: 'car 87', 经度: '4', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 88, 名称: 'car 88', 经度: '6', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 89, 名称: 'car 89', 经度: '8', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 90, 名称: 'car 90', 经度: '10', 纬度: '8', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 91, 名称: 'car 91', 经度: '-8', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 92, 名称: 'car 92', 经度: '-6', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 93, 名称: 'car 93', 经度: '-4', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 94, 名称: 'car 94', 经度: '-2', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 95, 名称: 'car 95', 经度: '0', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 96, 名称: 'car 96', 经度: '2', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 97, 名称: 'car 97', 经度: '4', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 98, 名称: 'car 98', 经度: '6', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 99, 名称: 'car 99', 经度: '8', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
          { 编号: 100, 名称: 'car 100', 经度: '10', 纬度: '10', 旋转: '0', 高度: '0.15', 数值: 60 },
        ],
        4: [
          { 编号: 1, 名称: 'car 1', 经度: '-10', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 2, 名称: 'car 2', 经度: '-8', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 3, 名称: 'car 3', 经度: '-6', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 4, 名称: 'car 4', 经度: '-4', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 5, 名称: 'car 5', 经度: '-2', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 6, 名称: 'car 6', 经度: '0', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 7, 名称: 'car 7', 经度: '2', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 8, 名称: 'car 8', 经度: '4', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 9, 名称: 'car 9', 经度: '6', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 10, 名称: 'car 10', 经度: '8', 纬度: '-8', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 11, 名称: 'car 11', 经度: '-10', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 12, 名称: 'car 12', 经度: '-8', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 13, 名称: 'car 13', 经度: '-6', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 14, 名称: 'car 14', 经度: '-4', 纬度: '-6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 15, 名称: 'car 15', 经度: '-2', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 16, 名称: 'car 16', 经度: '0', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 17, 名称: 'car 17', 经度: '2', 纬度: '-6', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 18, 名称: 'car 18', 经度: '4', 纬度: '-6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 19, 名称: 'car 19', 经度: '6', 纬度: '-6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 20, 名称: 'car 20', 经度: '8', 纬度: '-6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 21, 名称: 'car 21', 经度: '-10', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 22, 名称: 'car 22', 经度: '-8', 纬度: '-4', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 23, 名称: 'car 23', 经度: '-6', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 24, 名称: 'car 24', 经度: '-4', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 25, 名称: 'car 25', 经度: '-2', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 26, 名称: 'car 26', 经度: '0', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 27, 名称: 'car 27', 经度: '2', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 28, 名称: 'car 28', 经度: '4', 纬度: '-4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 29, 名称: 'car 29', 经度: '6', 纬度: '-4', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 30, 名称: 'car 30', 经度: '8', 纬度: '-4', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 31, 名称: 'car 31', 经度: '-10', 纬度: '-2', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 32, 名称: 'car 32', 经度: '-8', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 33, 名称: 'car 33', 经度: '-6', 纬度: '-2', 高度: '0.15', 旋转: '-90', 数值: 40 },
          { 编号: 34, 名称: 'car 34', 经度: '-4', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 35, 名称: 'car 35', 经度: '-2', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 36, 名称: 'car 36', 经度: '0', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 37, 名称: 'car 37', 经度: '2', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 38, 名称: 'car 38', 经度: '4', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 39, 名称: 'car 39', 经度: '6', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 40, 名称: 'car 40', 经度: '8', 纬度: '-2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 41, 名称: 'car 41', 经度: '-10', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 42, 名称: 'car 42', 经度: '-8', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 43, 名称: 'car 43', 经度: '-6', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 44, 名称: 'car 44', 经度: '-4', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 45, 名称: 'car 45', 经度: '-2', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 46, 名称: 'car 46', 经度: '0', 旋转: '-90', 纬度: '0', 高度: '0.15', 数值: 40 },
          { 编号: 47, 名称: 'car 47', 经度: '2', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 48, 名称: 'car 48', 经度: '4', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 49, 名称: 'car 49', 经度: '6', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 50, 名称: 'car 50', 经度: '8', 纬度: '0', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 51, 名称: 'car 51', 经度: '-10', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 52, 名称: 'car 52', 经度: '-8', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 53, 名称: 'car 53', 经度: '-6', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 54, 名称: 'car 54', 经度: '-4', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 55, 名称: 'car 55', 经度: '-2', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 56, 名称: 'car 56', 经度: '0', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 57, 名称: 'car 57', 经度: '2', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 58, 名称: 'car 58', 经度: '4', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 59, 名称: 'car 59', 经度: '6', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 60, 名称: 'car 60', 经度: '8', 纬度: '2', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 61, 名称: 'car 61', 经度: '-10', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 62, 名称: 'car 62', 经度: '-8', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 63, 名称: 'car 63', 经度: '-6', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 64, 名称: 'car 64', 经度: '-4', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 65, 名称: 'car 65', 经度: '-2', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 66, 名称: 'car 66', 经度: '0', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 67, 名称: 'car 67', 经度: '2', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 68, 名称: 'car 68', 经度: '4', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 69, 名称: 'car 69', 经度: '6', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 70, 名称: 'car 70', 经度: '8', 纬度: '4', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 71, 名称: 'car 71', 经度: '-10', 纬度: '6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 72, 名称: 'car 72', 经度: '-8', 旋转: '-90', 纬度: '6', 高度: '0.15', 数值: 40 },
          { 编号: 73, 名称: 'car 73', 经度: '-6', 旋转: '-90', 纬度: '6', 高度: '0.15', 数值: 40 },
          { 编号: 74, 名称: 'car 74', 经度: '-4', 旋转: '-90', 纬度: '6', 高度: '0.15', 数值: 40 },
          { 编号: 75, 名称: 'car 75', 经度: '-2', 旋转: '-90', 纬度: '6', 高度: '0.15', 数值: 40 },
          { 编号: 76, 名称: 'car 76', 经度: '0', 旋转: '-90', 纬度: '6', 高度: '0.15', 数值: 40 },
          { 编号: 77, 名称: 'car 77', 经度: '2', 纬度: '6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 78, 名称: 'car 78', 经度: '4', 纬度: '6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 79, 名称: 'car 79', 经度: '6', 纬度: '6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 80, 名称: 'car 80', 经度: '8', 纬度: '6', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 81, 名称: 'car 81', 经度: '-10', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 82, 名称: 'car 82', 经度: '-8', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 83, 名称: 'car 83', 经度: '-6', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 84, 名称: 'car 84', 经度: '-4', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 85, 名称: 'car 85', 经度: '-2', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 86, 名称: 'car 86', 经度: '0', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 87, 名称: 'car 87', 经度: '2', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 88, 名称: 'car 88', 经度: '4', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 89, 名称: 'car 89', 经度: '6', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 90, 名称: 'car 90', 经度: '8', 纬度: '8', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 91, 名称: 'car 91', 经度: '-10', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 92, 名称: 'car 92', 经度: '-8', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 93, 名称: 'car 93', 经度: '-6', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 94, 名称: 'car 94', 经度: '-4', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 95, 名称: 'car 95', 经度: '-2', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 96, 名称: 'car 96', 经度: '0', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 97, 名称: 'car 97', 经度: '2', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 98, 名称: 'car 98', 经度: '4', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 99, 名称: 'car 99', 经度: '6', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
          { 编号: 100, 名称: 'car 100', 经度: '8', 纬度: '10', 旋转: '-90', 高度: '0.15', 数值: 40 },
        ],
      }, //模型轨迹图数据集合
    },
    methods: {
      // 获取场景token
      getToken() {
        let _this = this;
        axios({
          method: 'post',
          url: 'https://www.tuguan.net/api/user/v1/visitorScene/' + sceneConfig.modelTrialUrl3,
        }).then((res) => {
          _this.init(res.data.accessToken);
        });
      },
      // 初始化加载图观三维场景服务
      init(token) {
        let _this = this;
        // 初始化图观App
        window.appInstance = new TGApp.App();
        window.appInstance.initService(
          {
            container: document.getElementById('container'),
            mode: 'scene',
            token: token,
            url: 'https://www.tuguan.net/publish/scene/api/' + sceneConfig.modelTrialUrl3, //模型地址
            resourceBasePath: 'https://www.tuguan.net/public/tgapp/scene', //在线引用资源地址
          },
          (result) => {
            console.log(result);
            if (result.result == 1) {
              _this.isZZ = false;
              // 显示场景信息
              _this.showSceneInfo();

              // 添加模型轨迹图
              _this.addStart();
            }
          }
        );
      },
      // 显示场景信息
      showSceneInfo() {
        appInstance.uniCall(
          'showSceneInfo',
          {
            isOpen: true,
          },
          (result) => {
            console.log(result);
          }
        );
      },

      //请求绘制轨迹图需要的所有数据
      requestData() {},

      // 添加模型轨迹图
      addStart() {
        let data = [];

        this.trailData[1].map((item, index) => {
          let obj = {
            id: item['编号'],
            label: item['名称'],
            coord: [item['经度'] * 5, item['纬度'] * 5], // XY 轴坐标，X：经度；Y：纬度
            coordZ: item['高度'], // Z 轴高度（单位：米）
            rotation: [0, parseInt(item['旋转']), 0],
            type: 'modelLayer', // 数据点图例类别
          };
          data.push(obj);
        });

        let jsonData = {
          id: 'modelLocus', // 模型对象图层 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
          name: 'layerName', // 图层名称，支持为图层自定义名称
          coordType: 1, // XY 轴坐标类别，0：X 经度，Y 纬度；1：X 米，Y米，相对世界00点
          coordTypeZ: 1, // Z 轴坐标类别，0：相对 3D 世界 0 海拔；1：相对 3D 世界地表；2：相对 3D 模型表面（单位：米）
          snapSurface: 0, // 启用自动贴地。0：不贴地；1：贴地
          duration: 1.5, // 从上一位置运动到新位置花费的时间（单位：秒），如果启用modelTrailData数据服务，同时表示同步数据的时间周期
          modelMaxDistance: 5000, // 模型最大可见距离（单位：米），不可见后显示icon
          iconMaxDistance: 100000, // icon最大可见距离（单位：米），不可见后隐藏
          isAutoRotation: false, // 是否自动根据当前位置和上一位置计算运动方向，如果为true的话，data中的rotation将不起作用。
          trackStyle: 'style001', // 尾迹内置风格，详见注释
          trackDuration: 6, // 尾迹粒子生命周期
          trackWidth: 20, // 尾迹粒子的宽度
          objLife: 60, // 批号消批时间长度
          modelTrailDataId: '', // 对应本服务器上modelTrail数据Id，如果找到id，则下方的data不起作用
          visible: true, // 添加当前图层时默认显示还是隐藏
          isReferenceType:true,
          legends: [
            {
              name: 'modelLayer', // 图层内图例名称，新建时调用者自己传入的唯一名称，用于各种操作的图例识别
              modelType: 'DemoCar', // 模型类型
              scale: 1, // 整体放缩倍数（单位：倍）
              iconName: 'car', // 内置图标名称，详见下表：内置图标；或根据项目，在场景中预置好的图标对象的名称，包含文字样式定义
              labelColor: '#ff0000', // 标签文本颜色，可选值，默认白色
              labelBackgroundColor: '#333333', // 标签文本背景颜色，可选值，默认灰色
            },
          ],
          data: data,
        };
        appInstance.uniCall('addModelTrailLayer', jsonData, (result) => {
          console.log(result);
          this.updateModelTrail(2);
        });
      },
      // 更新模型轨迹图
      updateModelTrail(i) {
        var _this = this;
        setTimeout(() => {
          var data = [];
          this.trailData[i].map((item, index) => {
            let obj = {
              id: item['编号'],
              label: item['名称'],
              coord: [item['经度'] * 5, item['纬度'] * 5], // XY 轴坐标，X：经度；Y：纬度
              coordZ: item['高度'], // Z 轴高度（单位：米）
              rotation: [0, parseInt(item['旋转']), 0],
              type: 'modelLayer', // 数据点图例类别
            };
            data.push(obj);
          });
          let jsonData = {
            id: 'modelLocus',
            name: 'layerName',
            coordType: 1,
            coordTypeZ: 1,
            isAppend: true,
            duration: 3,
            data: data,
          };
          appInstance.uniCall('updateModelTrailLayerCoord', jsonData, (result) => {
            i++;
            if (i > 4) {
              i = 1;
            }
            _this.updateModelTrail(i);
          });
        }, 3000);
      },
    },

    mounted() {
      this.getToken();
    },
  });
};
