window.onload = function () {
  var vm = new Vue({
    el: "#app",
    data: {
      isZZ: true,
      legendList: [
        {
          id: 1,
          action: "波浪线型",
          checked: true,
          Ids: "default",
        },
        {
          id: 2,
          action: "箭头型",
          checked: true,
          Ids: "arrow",
        },
        {
          id: 3,
          action: "虚线型",
          checked: true,
          Ids: "dot",
        },
        {
          id: 4,
          action: "射线型",
          checked: true,
          Ids: "ray",
        },
      ],
    },
    methods: {
      // 获取场景token
      getToken() {
        let _this = this;
        axios({
          method: "post",
          url:
            "https://www.tuguan.net/api/user/v1/visitorScene/" +
            sceneConfig.worldUrl,
        }).then((res) => {
          _this.init(res.data.accessToken);
        });
      },
      // 初始化加载图观三维场景服务
      init(token) {
        let _this = this;
        //使用授权码读取模型文件初始化场景
        window.appInstance = new TGApp.App();
        window.appInstance.initService(
          {
            container: document.getElementById("container"),
            mode: "scene",
            token: token,
            url:
              "https://www.tuguan.net/publish/scene/api/" +
              sceneConfig.worldUrl, //模型地址
            resourceBasePath: "https://www.tuguan.net/public/tgapp/scene", //在线引用资源地址
          },
          (result) => {
            if (result.result == 1) {
              _this.showSceneInfo();
              _this.isZZ = false;
              _this.addArrow();
              _this.addDefault();
              _this.addDot();
              _this.addRay();
            }
          }
        );
      },
      // 显示场景信息
      showSceneInfo() {
        appInstance.uniCall(
          "showSceneInfo",
          {
            isOpen: true,
          },
          (result) => {}
        );
      },
      //添加关系图层，不同样式枚举
      addDefault() {
        let jsonData = {
          id: "default", // 图层对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
          name: "关系图", // 图层名称，支持为图层自定义名称
          coordType: 0, // XY 轴坐标类别，0：X 经度，Y 纬度；1：X 米，Y米，相对世界00点
          coordTypeZ: 0, // Z 轴坐标类别，0：相对 3D 世界 0 海拔；1：相对 3D 世界地表；2：相对 3D 模型表面（单位：米）
          isShowBubble: true, // 是否显示气泡，默认显示，true / false
          bubbleRadiusMax: 800000, // 气泡最大半径
          bubbleRadiusMin: 500000, // 气泡最小半径
          bubbleSpeed: 200000, // 气泡扩散速度（单位：米/秒）
          lineWidthMax: 80000, // 连线最大宽度（单位：米）
          lineWidthMin: 80000, // 连线最小宽度（单位：米）
          lineSpeed: 100000, // 连线动画速度(单位:米/秒)
          curvature: 0.8, // 连线曲度调节(取值范围 -1 ~ 1, 0为直线, 此值越接近0曲线越平, 反之曲线越陡峭)
          valueMax: 10, // 数据最大值上限
          valueMin: 10, // 数据最小值上限
          visible: true, // 添加当前图层时默认是显示还是隐藏
          legends: [
            // 定义图层包含图例，支持为不同图例定义各自样式
            {
              name: "odline1", // 图层内图例名称，新建时调用者自己传入的唯一名称，用于各种操作的图例识别
              type: "default", // 路线样式类别 default 波浪线型, arrow 箭头型, dot 虚线型, ray 射线型, pulse 脉冲型
              bubbleColor: "#c7150c", // 起点终点气泡 颜色（HEX颜色值）
              lineColor: "#c7150c", // 连线颜色（HEX颜色值）
              labelColor: "#FFFFFF", // 标签文本颜色，可选值，默认白色
              labelBackgroundColor: "#333333", // 标签文本背景颜色，可选值，默认灰色
              labelFontSize: 5, // 标签文本字体大小，数值越大，文字越大
            },
          ],
          data: [
            // 定义图层可视化数据
            {
              id: "1", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [165.75442222742595, 66.82756114536254], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "2", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [108.03751154969366, 67.62750268047844], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "3", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [55.96401749477759, 63.470625263983216], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "4", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [46.437461960706386, 22.805069596609084], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "5", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [19.925635899440152, 52.116686660569165], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "6", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [24.133602216859323, 67.83635708996395], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "7", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [43.486218257888105, 41.08374259308447], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "8", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-3.1032543382419147, 17.705874360863497], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "9", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [112.54775656662515, 0.47097458546085], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "10", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [141.34937854055352, -5.0289738684308025], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "11", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [136.63034318373235, -24.753466549945006], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "12", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [171.7192930666055, -42.61600042870417], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "13", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [25.209737396578547, -24.663888942150802], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "14", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [44.1908502326097, 25.342847688855002], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "15", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-69.13893716750964, -42.165701113542106], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "16", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-56.62530183719268, -11.775827307853922], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "17", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-97.22757115381968, 38.48966693264769], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "18", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-108.50758032075363, 62.86794796094148], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "19", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-153.73384426212772, 65.20855537922972], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "20", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-75.21304928865096, 81.98932422118624], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "21", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [135.1361044483743, -25.125890626723056], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "22", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-39.582853174102816, 76.3772331243368], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.42837446823759, 28.89930912545764], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
          ],
        };

        appInstance.uniCall("addODLineLayer", jsonData, (result) => {
          console.log(result);
        });
      },

      addDot() {
        let jsonData = {
          id: "dot", // 图层对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
          name: "关系图", // 图层名称，支持为图层自定义名称
          coordType: 0, // XY 轴坐标类别，0：X 经度，Y 纬度；1：X 米，Y米，相对世界00点
          coordTypeZ: 0, // Z 轴坐标类别，0：相对 3D 世界 0 海拔；1：相对 3D 世界地表；2：相对 3D 模型表面（单位：米）
          isShowBubble: true, // 是否显示气泡，默认显示，true / false
          bubbleRadiusMax: 800000, // 气泡最大半径
          bubbleRadiusMin: 500000, // 气泡最小半径
          bubbleSpeed: 200000, // 气泡扩散速度（单位：米/秒）
          lineWidthMax: 80000, // 连线最大宽度（单位：米）
          lineWidthMin: 80000, // 连线最小宽度（单位：米）
          lineSpeed: 100000, // 连线动画速度(单位:米/秒)
          curvature: 0.8, // 连线曲度调节(取值范围 -1 ~ 1, 0为直线, 此值越接近0曲线越平, 反之曲线越陡峭)
          valueMax: 10, // 数据最大值上限
          valueMin: 10, // 数据最小值上限
          visible: true, // 添加当前图层时默认是显示还是隐藏
          legends: [
            // 定义图层包含图例，支持为不同图例定义各自样式
            {
              name: "odline1", // 图层内图例名称，新建时调用者自己传入的唯一名称，用于各种操作的图例识别
              type: "dot", // 路线样式类别 default 波浪线型, arrow 箭头型, dot 虚线型, ray 射线型, pulse 脉冲型
              bubbleColor: "#66cc33", // 起点终点气泡 颜色（HEX颜色值）
              lineColor: "#66cc33", // 连线颜色（HEX颜色值）
              labelColor: "#FFFFFF", // 标签文本颜色，可选值，默认白色
              labelBackgroundColor: "#333333", // 标签文本背景颜色，可选值，默认灰色
              labelFontSize: 5, // 标签文本字体大小，数值越大，文字越大
            },
          ],
          data: [
            // 定义图层可视化数据
            {
              id: "1", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [124.15546774188995, 48.45068602800257], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [102.09476347558973, 47.08931066716663], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "2", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [102.09476347558973, 47.08931066716663], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [69.9799126482742, 49.983926524876985], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "3", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [69.9799126482742, 49.983926524876985], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [91.15843136649558, 34.62137248366737], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "4", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [91.15843136649558, 34.62137248366737], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [109.52691395091868, 25.745934881892936], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "5", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [109.52691395091868, 25.745934881892936], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [66.53062279948229, 29.21149874207311], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "6", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [66.53062279948229, 29.21149874207311], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [49.57886309384523, 60.501607677406284], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "7", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [49.57886309384523, 60.501607677406284], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [98.08805628296504, 67.71475145653872], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "8", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [98.08805628296504, 67.71475145653872], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [75.11058104892858, 62.16505508107355], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "9", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [75.11058104892858, 62.16505508107355], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [43.08577562969245, 38.39716988006231], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "10", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [43.08577562969245, 38.39716988006231], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [47.52332083159567, 22.508112722461014], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "11", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [47.52332083159567, 22.508112722461014], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [33.34262742933765, 57.112991661622885], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "12", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [33.34262742933765, 57.112991661622885], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [28.780769456275024, 26.678404250470354], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "13", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [28.780769456275024, 26.678404250470354], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [32.12267035436382, 15.862765140190056], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "14", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [32.12267035436382, 15.862765140190056], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [37.51923501135768, 1.387471679028606], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "15", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [37.51923501135768, 1.387471679028606], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [20.578579265817925, -5.850505281306517], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "16", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [20.578579265817925, -5.850505281306517], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [26.09217811022565, -28.440976665456976], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "17", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [26.09217811022565, -28.440976665456976], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [15.091983427561837, -19.955757111442725], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "18", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [15.091983427561837, -19.955757111442725], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [2.216809952948777, 9.496460431771562], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "19", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [2.216809952948777, 9.496460431771562], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [119.77073533581017, -31.445375476936245], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "20", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [2.216809952948777, 9.496460431771562], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [22.37335901807676, 50.80390518968581], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "21", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [22.37335901807676, 50.80390518968581], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-39.22166435983774, 69.75258274174023], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "22", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [22.37335901807676, 50.80390518968581], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-39.697200342334106, 81.02080808211059], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "23", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-39.697200342334106, 81.02080808211059], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-119.87579226359169, 63.35975021316465], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "24", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-119.87579226359169, 63.35975021316465], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-101.30002497775735, 33.52636220640934], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "25", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-101.30002497775735, 33.52636220640934], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-8.572858670838801, 19.38791520648211], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "26", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-8.572858670838801, 19.38791520648211], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-70.69420716966583, -48.28074252370843], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
          ],
        };

        appInstance.uniCall("addODLineLayer", jsonData, (result) => {
          console.log(result);
        });
      },
      addArrow() {
        let jsonData = {
          id: "arrow", // 图层对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
          name: "关系图", // 图层名称，支持为图层自定义名称
          coordType: 0, // XY 轴坐标类别，0：X 经度，Y 纬度；1：X 米，Y米，相对世界00点
          coordTypeZ: 0, // Z 轴坐标类别，0：相对 3D 世界 0 海拔；1：相对 3D 世界地表；2：相对 3D 模型表面（单位：米）
          isShowBubble: true, // 是否显示气泡，默认显示，true / false
          bubbleRadiusMax: 800000, // 气泡最大半径
          bubbleRadiusMin: 500000, // 气泡最小半径
          bubbleSpeed: 200000, // 气泡扩散速度（单位：米/秒）
          lineWidthMax: 80000, // 连线最大宽度（单位：米）
          lineWidthMin: 80000, // 连线最小宽度（单位：米）
          lineSpeed: 100000, // 连线动画速度(单位:米/秒)
          curvature: 0.8, // 连线曲度调节(取值范围 -1 ~ 1, 0为直线, 此值越接近0曲线越平, 反之曲线越陡峭)
          valueMax: 10, // 数据最大值上限
          valueMin: 10, // 数据最小值上限
          visible: true, // 添加当前图层时默认是显示还是隐藏
          legends: [
            // 定义图层包含图例，支持为不同图例定义各自样式
            {
              name: "odline1", // 图层内图例名称，新建时调用者自己传入的唯一名称，用于各种操作的图例识别
              type: "arrow", // 路线样式类别 default 波浪线型, arrow 箭头型, dot 虚线型, ray 射线型, pulse 脉冲型
              bubbleColor: "#f1c40f", // 起点终点气泡 颜色（HEX颜色值）
              lineColor: "#f1c40f", // 连线颜色（HEX颜色值）
              labelColor: "#FFFFFF", // 标签文本颜色，可选值，默认白色
              labelBackgroundColor: "#333333", // 标签文本背景颜色，可选值，默认灰色
              labelFontSize: 5, // 标签文本字体大小，数值越大，文字越大
            },
          ],
          data: [
            // 定义图层可视化数据
            {
              id: "1", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-152.9774987395378, 65.84926494258563], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-40.17831626829671, 78.10541197080839], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "2", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-40.17831626829671, 78.10541197080839], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [19.726666274207325, 67.53679785965923], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "3", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [19.726666274207325, 67.53679785965923], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [1.4294839556694345, 46.271931744376204], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "4", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [1.4294839556694345, 46.271931744376204], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [35.483500362426305, 39.865010718049966], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "5", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [35.483500362426305, 39.865010718049966], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [54.84749301039965, 61.23764919054779], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "6", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [54.84749301039965, 61.23764919054779], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [70.37659353564344, 46.02720710626618], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "7", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [70.37659353564344, 46.02720710626618], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.64702554453594, 38.7441077945816], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "8", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [176.27055958052603, -39.03682925288117], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [137.84968563187175, -25.34404083356128], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "9", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [137.84968563187175, -25.34404083356128], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [143.63593301432823, -5.040104330362111], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "10", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [143.63593301432823, -5.040104330362111], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [114.10677124273113, -0.0057256631165846575], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "11", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [114.10677124273113, -0.0057256631165846575], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [102.11207216737314, 16.795899775146445], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "12", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [101.64235734541553, 16.102772459247223], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [138.9434651709256, 36.864816610944814], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "13", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [138.9434651709256, 36.864816610944814], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.64702554453594, 38.7441077945816], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "14", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-113.4523199647659, 57.35388415248389], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-102.99809881006563, 38.224607272261345], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "15", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-102.99809881006563, 38.224607272261345], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-72.79633437051902, 3.561328038046906], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "16", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-72.79633437051902, 3.561328038046906], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-67.27675215328534, -41.89929856871872], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "17", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-67.27675215328534, -41.89929856871872], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-10.190152581166988, 22.345110928703367], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "18", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [-10.190152581166988, 22.345110928703367], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [25.289176751361698, 11.924364085882711], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "19", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [25.289176751361698, 11.924364085882711], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [25.997352766636457, -28.959252282781005], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "20", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [25.997352766636457, -28.959252282781005], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [79.63467839829006, 22.78141464244954], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "21", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [79.63467839829006, 22.78141464244954], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [110.64702554453594, 38.7441077945816], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
          ],
        };

        appInstance.uniCall("addODLineLayer", jsonData, (result) => {
          console.log(result);
        });
      },
      addRay() {
        let jsonData = {
          id: "ray", // 图层对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
          name: "关系图", // 图层名称，支持为图层自定义名称
          coordType: 0, // XY 轴坐标类别，0：X 经度，Y 纬度；1：X 米，Y米，相对世界00点
          coordTypeZ: 0, // Z 轴坐标类别，0：相对 3D 世界 0 海拔；1：相对 3D 世界地表；2：相对 3D 模型表面（单位：米）
          isShowBubble: true, // 是否显示气泡，默认显示，true / false
          bubbleRadiusMax: 800000, // 气泡最大半径
          bubbleRadiusMin: 500000, // 气泡最小半径
          bubbleSpeed: 200000, // 气泡扩散速度（单位：米/秒）
          lineWidthMax: 80000, // 连线最大宽度（单位：米）
          lineWidthMin: 80000, // 连线最小宽度（单位：米）
          lineSpeed: 100000, // 连线动画速度(单位:米/秒)
          curvature: 0.8, // 连线曲度调节(取值范围 -1 ~ 1, 0为直线, 此值越接近0曲线越平, 反之曲线越陡峭)
          valueMax: 10, // 数据最大值上限
          valueMin: 10, // 数据最小值上限
          visible: true, // 添加当前图层时默认是显示还是隐藏
          legends: [
            // 定义图层包含图例，支持为不同图例定义各自样式
            {
              name: "odline1", // 图层内图例名称，新建时调用者自己传入的唯一名称，用于各种操作的图例识别
              type: "ray", // 路线样式类别 default 波浪线型, arrow 箭头型, dot 虚线型, ray 射线型, pulse 脉冲型
              bubbleColor: "#0cbec7", // 起点终点气泡 颜色（HEX颜色值）
              lineColor: "#0cbec7", // 连线颜色（HEX颜色值）
              labelColor: "#FFFFFF", // 标签文本颜色，可选值，默认白色
              labelBackgroundColor: "#333333", // 标签文本背景颜色，可选值，默认灰色
              labelFontSize: 5, // 标签文本字体大小，数值越大，文字越大
            },
          ],
          data: [
            // 定义图层可视化数据
            {
              id: "1", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [102.59619448878946, 66.8015858120313], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "2", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [69.70076859544284, 48.677450852993154], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "3", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [45.23763872861648, 24.134723529641892], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "4", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [18.903186787951423, 52.540789244552776], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "5", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [115.297637744687, -0.19013200094227234], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "6", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [1.8301578573179986, 32.144666642803216], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "7", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-98.43757540561589, 40.10225691876183], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "8", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-38.75382574348334, 77.39208952648619], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "9", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-113.65875988352838, 63.19704678084369], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "10", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-2.728611199933967, 40.73875328186726], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "11", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-62.417288580990416, -33.663689603654], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "12", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [26.51434709557165, 67.71723099038995], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "13", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [2.2444410268684267, 46.49268819756415], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "14", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [142.03236192985963, -6.062480985819299], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "15", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [175.21196061180257, -38.042512196004054], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "16", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [139.0042374612278, 36.61784951962242], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "17", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [33.72351147647204, 38.79467099187699], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "18", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-17.029435019769025, 64.98326349519316], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "19", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-52.35655803056518, -7.472511186526846], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "20", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [-70.51797608056182, -47.28464686601929], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "21", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [135.1361044483743, -25.125890626723056], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
            {
              id: "22", // 图层子对象 id，新建时调用者自己传入的唯一标识，用于各种操作的对象识别
              startCoord: [107.92125397015704, 35.7700131375601], // 起点 XY 轴坐标，X：经度；Y：纬度
              startCoordZ: 0, // 起点 Z 轴高度（单位：米）
              targetCoord: [78.69869606166527, 24.15013830237345], // 终点点 XY 轴坐标，X：经度；Y：纬度
              targetCoordZ: 0, // 终点 Z 轴高度（单位：米）
              label: "", // 标签文本，如果为 ""，则不显示标签
              value: 10, // 数据点权值
              type: "odline1", // 数据点图例类别
            },
          ],
        };

        appInstance.uniCall("addODLineLayer", jsonData, (result) => {
          console.log(result);
        });
      },
      //点击切换，CheckBox控制关系图显示或隐藏
      controlChecked(el, idx) {
        el.checked = !el.checked;
        let jsonData = {
          id: el.Ids,
          overlayType: "ODLineLayer",
          visible: el.checked,
        };

        appInstance.uniCall("setOverlayVisibility", jsonData, (result) => {
          console.log(result);
        });
      },
    },

    mounted() {
      this.getToken();
    },
  });
};
